## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/64340904/runs/68d64761-0ea7-4acf-b6fd-9c330c8eaa74).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>


## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:
**Command**: `terraform plan -detailed-exitcode -out /tmp/tmpbsv7v0xl/plan`
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.mock_api will be created
+   resource "aws_api_gateway_deployment" "mock_api" {
+       created_date  = (known after apply)
+       execution_arn = (known after apply)
+       id            = (known after apply)
+       invoke_url    = (known after apply)
+       rest_api_id   = (known after apply)
+       stage_name    = "test"
    }

  # aws_api_gateway_integration.weather_integration will be created
+   resource "aws_api_gateway_integration" "weather_integration" {
+       cache_namespace      = (known after apply)
+       connection_type      = "INTERNET"
+       http_method          = "GET"
+       id                   = (known after apply)
+       passthrough_behavior = (known after apply)
+       request_templates    = {
+           "application/json" = jsonencode(
                {
+                   statusCode = 200
                }
            )
        }
+       resource_id          = (known after apply)
+       rest_api_id          = (known after apply)
+       timeout_milliseconds = 29000
+       type                 = "MOCK"
    }

  # aws_api_gateway_integration_response.weather_integration_response will be created
+   resource "aws_api_gateway_integration_response" "weather_integration_response" {
+       http_method        = "GET"
+       id                 = (known after apply)
+       resource_id        = (known after apply)
+       response_templates = {
+           "application/json" = jsonencode(
                {
+                   forecast     = "Sunny"
+                   mock_message = "Mock API response for testing"
+                   temperature  = "22C"
                }
            )
        }
+       rest_api_id        = (known after apply)
+       selection_pattern  = (sensitive value)
+       status_code        = "200"
    }

  # aws_api_gateway_method.weather_get will be created
+   resource "aws_api_gateway_method" "weather_get" {
+       api_key_required   = false
+       authorization      = "NONE"
+       http_method        = "GET"
+       id                 = (known after apply)
+       request_parameters = {
+           "method.request.header.X-Api-Key" = true
        }
+       resource_id        = (known after apply)
+       rest_api_id        = (known after apply)
    }

  # aws_api_gateway_method_response.weather_response will be created
+   resource "aws_api_gateway_method_response" "weather_response" {
+       http_method     = "GET"
+       id              = (known after apply)
+       resource_id     = (known after apply)
+       response_models = {
+           "application/json" = "Empty"
        }
+       rest_api_id     = (known after apply)
+       status_code     = "200"
    }

  # aws_api_gateway_resource.weather_resource will be created
+   resource "aws_api_gateway_resource" "weather_resource" {
+       id          = (known after apply)
+       parent_id   = (known after apply)
+       path        = (known after apply)
+       path_part   = "weather"
+       rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.mock_api will be created
+   resource "aws_api_gateway_rest_api" "mock_api" {
+       api_key_source               = (known after apply)
+       arn                          = (known after apply)
+       binary_media_types           = (known after apply)
+       created_date                 = (known after apply)
+       description                  = "Mock API for testing Lambda with Doppler secret"
+       disable_execute_api_endpoint = (known after apply)
+       execution_arn                = (known after apply)
+       id                           = (known after apply)
+       minimum_compression_size     = (known after apply)
+       name                         = "MockWeatherAPI"
+       policy                       = (known after apply)
+       root_resource_id             = (known after apply)
+       tags_all                     = (known after apply)
    }

  # aws_iam_role.lambda_role will be created
+   resource "aws_iam_role" "lambda_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "lambda.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "lambda-execution-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_policy will be created
+   resource "aws_iam_role_policy_attachment" "lambda_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
+       role       = "lambda-execution-role"
    }

  # aws_lambda_function.mock_api_lambda will be created
+   resource "aws_lambda_function" "mock_api_lambda" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       code_sha256                    = (known after apply)
+       description                    = "Lambda to call mock API with Doppler secret"
+       filename                       = "lambda_function.zip"
+       function_name                  = "mock-api-test-function"
+       handler                        = "lambda_function.lambda_handler"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = false
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = (known after apply)
+       runtime                        = "python3.9"
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       skip_destroy                   = false
+       source_code_hash               = "ZpV5qe+dW6ETxV/8sBIb4bcICOnahSfDYdG06nOifCw="
+       source_code_size               = (known after apply)
+       tags_all                       = (known after apply)
+       timeout                        = 10
+       version                        = (known after apply)

+       environment {
+           variables = (known after apply)
        }
    }

  # doppler_secret.demo_password will be created
+   resource "doppler_secret" "demo_password" {
+       computed   = (sensitive value)
+       config     = "dev"
+       id         = (known after apply)
+       name       = "DEMO_PASSWORD"
+       project    = "example-project"
+       value      = (sensitive value)
+       value_type = "string"
+       visibility = "masked"
    }

  # random_password.demo_password will be created
+   resource "random_password" "demo_password" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       length      = 32
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = true
+       upper       = true
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   lambda_function_arn = (known after apply)
+   mock_api_url        = (known after apply)
+   resource_value      = (known after apply)

```

</details>

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
